<?php
/**
 +------------------------------------------------------------------------------
 * DaigouCMS 代购建站系统(淘宝版)
 *
 * 支付方式
 +------------------------------------------------------------------------------
 * @category   ulowi
 * @author    	soitun <stone@zline.net.cn>
 * @copyright 上海子凌网络科技有限公司
 * @license   	http://www.zline.net.cn/license-agreement.html
 * @link      		http://www.zline.net.cn/
 +------------------------------------------------------------------------------
 */

class PaymentAction extends Action {
	
	//------------------------------------------------------------------------------------------------
	public function index() {
		$this->redirect ( 'credit' );
	}
	
	//------------------------------------------------------------------------------------------------
	public function credit() {
		$this->assign ('title','我有国外信用卡-账户充值说明-viatang.com');
	         $this->assign ('keywords','paypal充值,支付宝充值,国际引用卡充值,外币充值,代购商品支付,淘宝代购支付,即时到帐,加入购物车，中国代购,代购中国商品,淘宝代购,海外华人代购,美国代购,美国代购网,代购网站,加拿大代购,留学生代购,服装代购,图书代购');
                  $this->assign ('description','代购paypal、支付宝充值,淘宝代购商品支付，国际信用卡支付，外币支付，支持paypal、国际信用卡支付方式.批量下单,多件商品集中寄送,专享超低国际运费3折起.');
		$this->display ();
	}
	
	//------------------------------------------------------------------------------------------------
	public function paypal() {
		$this->assign ('title','paypal充值-账户充值说明-viatang.com');
	         $this->assign ('keywords','paypal充值,支付宝充值,国际引用卡充值,外币充值,代购商品支付,淘宝代购支付,即时到帐,加入购物车，中国代购,代购中国商品,淘宝代购,海外华人代购,美国代购,美国代购网,代购网站,加拿大代购,留学生代购,服装代购,图书代购');
                  $this->assign ('description','代购paypal、支付宝充值,淘宝代购商品支付，国际信用卡支付，外币支付，支持paypal、国际信用卡支付方式.批量下单,多件商品集中寄送,专享超低国际运费3折起.');
		$this->display ();
	}
	
	//------------------------------------------------------------------------------------------------
	public function creditcn() {
		$this->assign ('title','我有国内信用卡-账户充值说明-viatang.com');
	         $this->assign ('keywords','国内信用卡支付,paypal充值,支付宝充值,国际引用卡充值,外币充值,代购商品支付,淘宝代购支付,即时到帐,加入购物车，中国代购,代购中国商品,淘宝代购,海外华人代购,美国代购,美国代购网,代购网站,加拿大代购,留学生代购,服装代购,图书代购');
                  $this->assign ('description','代购paypal、支付宝充值,淘宝代购商品支付，国际信用卡支付，外币支付，支持paypal、国际信用卡支付方式.批量下单,多件商品集中寄送,专享超低国际运费3折起.');
		$this->display ();
	}
	
	//------------------------------------------------------------------------------------------------
	public function xianjin() {
		$this->assign ('title','我有现金/国外银行卡-账户充值说明-viatang.com');
	         $this->assign ('keywords','现金支付,paypal充值,支付宝充值,国际引用卡充值,外币充值,代购商品支付,淘宝代购支付,即时到帐,加入购物车，中国代购,代购中国商品,淘宝代购,海外华人代购,美国代购,美国代购网,代购网站,加拿大代购,留学生代购,服装代购,图书代购');
                  $this->assign ('description','代购paypal、支付宝充值,淘宝代购商品支付，国际信用卡支付，外币支付，支持paypal、国际信用卡支付方式.批量下单,多件商品集中寄送,专享超低国际运费3折起.');
		$this->display ();
	}
	
	//------------------------------------------------------------------------------------------------
	public function alipay() {
		$this->assign ('title','支付宝充值-账户充值说明-viatang.com');
	         $this->assign ('keywords','paypal充值,支付宝充值,国际引用卡充值,外币充值,代购商品支付,淘宝代购支付,即时到帐,加入购物车，中国代购,代购中国商品,淘宝代购,海外华人代购,美国代购,美国代购网,代购网站,加拿大代购,留学生代购,服装代购,图书代购');
                  $this->assign ('description','代购paypal、支付宝充值,淘宝代购商品支付，国际信用卡支付，外币支付，支持paypal、国际信用卡支付方式.批量下单,多件商品集中寄送,专享超低国际运费3折起.');
		$this->display ();
	}
	
	//------------------------------------------------------------------------------------------------
	public function qinyou() {
		$this->assign ('title','我有亲友可代付款-账户充值说明-viatang.com');
	         $this->assign ('keywords','我有亲友可代付款,paypal充值,支付宝充值,国际引用卡充值,外币充值,代购商品支付,淘宝代购支付,即时到帐,加入购物车，中国代购,代购中国商品,淘宝代购,海外华人代购,美国代购,美国代购网,代购网站,加拿大代购,留学生代购,服装代购,图书代购');
                  $this->assign ('description','代购paypal、支付宝充值,淘宝代购商品支付，国际信用卡支付，外币支付，支持paypal、国际信用卡支付方式.批量下单,多件商品集中寄送,专享超低国际运费3折起.');
		$this->display ();
	}
	
	//------------------------------------------------------------------------------------------------
	public function bank() {
		$this->assign ('title','海外电汇-账户充值说明-viatang.com');
	         $this->assign ('keywords','海外电汇,paypal充值,支付宝充值,国际引用卡充值,外币充值,代购商品支付,淘宝代购支付,即时到帐,加入购物车，中国代购,代购中国商品,淘宝代购,海外华人代购,美国代购,美国代购网,代购网站,加拿大代购,留学生代购,服装代购,图书代购');
                  $this->assign ('description','代购paypal、支付宝充值,淘宝代购商品支付，国际信用卡支付，外币支付，支持paypal、国际信用卡支付方式.批量下单,多件商品集中寄送,专享超低国际运费3折起.');
		$this->display ();
	}
	
	//------------------------------------------------------------------------------------------------
	public function daofu() {
		$this->display ();
	}
}
?>