<?php
/**
 +------------------------------------------------------------------------------
 * DaigouCMS 代购建站系统(淘宝版)
 * 
 * 	服务介绍
 +------------------------------------------------------------------------------ 
 * @copyright 上海子凌网络科技有限公司˾
 * @author    stone@ulowi.com
 * @version   1.0
 +------------------------------------------------------------------------------
 */

class ServiceAction extends HomeAction {
	
	function _initialize() {
		parent::_initialize();
		$RegUserCount = M ( 'User' )->count ();
		$this->assign('RegUserCount',$RegUserCount * 10100);
	}
	
	//------------------------------------------------------------------------------------------------
	public function index() {
        $this->assign ('title','代购服务与介绍-专为全球海外华人、留学生代购中国商品，提供淘宝代购服务-viatang.com');
	    $this->assign ('keywords','代购，淘宝代购，代购网，代购中国，掏宝代购，taobao，美国代购，留学生代购，加拿大代购，海外代购，代购中国商品，服装代购，图书代购，食品代购，生活用品代购');
        $this->assign ('description','唯唐代购提供一站式代购中国商品，提供淘宝代购、天猫、阿里巴巴、京东、当当、亚马逊等不同店铺商品，集中采购、批量打包配送全球，享最低国际运费12元起');
		$this->display ();
	}
	
	//------------------------------------------------------------------------------------------------
	//自助购
	public function selfbuy(){
        $this->assign ('title','包裹转运、代寄服务介绍-为全球海外华人、留学生提供中国商品转寄服务-viatang.com');
	    $this->assign ('keywords','国际转运,淘宝代邮,淘宝转寄,包裹转寄,淘宝代购,代购,国际转运服务,Viatang国际转运,');
        $this->assign ('description','专为海外的华人、留学生及家人提供商品代邮、包裹代寄服务，在中国购物网站自行下单，将商品寄送至Viatang代购网包裹处理中心，由Viatang代购专人为您提供验货，随时提交运送申请，我们为您将商品集中打包配送至全球，包裹3-7天送达');
		$this->display();	
	}
	
	//------------------------------------------------------------------------------------------------
	//国际转运（原自助购）
	public function trans(){
		$dao = M ( 'DeliverCompany' );
		$list = $dao->select();		
		$this->assign('list',$list);
        $this->assign ('title','包裹转运流程介绍、包裹代邮、淘宝商品转运、淘宝国际代邮、代寄服务介绍、代购流程、如何提交包裹转运-为全球海外华人、留学生提供中国商品转寄服务-viatang.com');
	    $this->assign ('keywords','包裹转运,淘宝代邮,淘宝转寄,包裹转寄,国际转运,淘宝代购,代购,国际转运服务,Viatang国际转运,');
        $this->assign ('description','专为海外的华人、留学生及家人提供商品代邮、包裹代寄、淘宝转运、国际转运，在中国购物网站自行下单，将商品寄送至Viatang代购网包裹处理中心，由Viatang代购专人为您提供验货，随时提交运送申请，我们为您将商品集中打包配送至全球，包裹3-7天送达');
		$this->display();	
	}

	//------------------------------------------------------------------------------------------------
	//转运
	public function fee(){
		$this->assign('title','代购流程 如何代购');
		$this->display();
	}
	

	//------------------------------------------------------------------------------------------------
	//惠
	public function vip(){
		$this->assign('title','会员vip');
		$this->display();
	}
	
	//------------------------------------------------------------------------------------------------
	//港速通
	public function hkexpress(){
		$this->assign('title','港速通');
		$this->display();
	}
}
?>