<?php
/**
 +------------------------------------------------------------------------------
 * DaigouCMS 代购建站系统(淘宝版)
 *
 * 价格说明
 +------------------------------------------------------------------------------
 * @category   ulowi
 * @author    	soitun <stone@zline.net.cn>
 * @copyright 上海子凌网络科技有限公司
 * @license   	http://www.zline.net.cn/license-agreement.html
 * @link      		http://www.zline.net.cn/
 +------------------------------------------------------------------------------
 */

class PostageAction extends Action {

	//------------------------------------------------------------------------------------------------
	function _initialize() {
		Session::set ( C( 'RETURN_URL' ), MODULE_NAME . ',' . ACTION_NAME );
		$refer_url = Session::get('referer_url');
		if(empty($refer_url)){
			Session::set ( 'referer_url',$_SERVER ["HTTP_REFERER"] );
		}
	}

	//------------------------------------------------------------------------------------------------
	public function index() {
		$this->display ();
	}
	
	//------------------------------------------------------------------------------------------------
	public function ems() {
		$this->display ();
	}
	
	//------------------------------------------------------------------------------------------------
	public function air() {
		$this->display ();
	}
	
	//------------------------------------------------------------------------------------------------
	public function sal() {
		$this->display ();
	}
	
	//------------------------------------------------------------------------------------------------
	public function sea() {
		$this->display ();
	}
	
	//------------------------------------------------------------------------------------------------
	public function cn() {
		$this->display ();
	}
	
	//------------------------------------------------------------------------------------------------
	Public function _empty() {
		$this->redirect ( 'index' );
	}
}
?>